#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖``

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
tls_private_key.main: Refreshing state... [id=9406ecceadf90e3697c1cc49c1cef4731dca6f91]
data.azurerm_client_config.current: Reading...
data.azurerm_resource_group.example: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0zMDRkYWIyZS0wZmQwLTRjNDItOTk4MC1hNDU5ZjkzMzc0ODg7b2JqZWN0SWQ9NmRjZjI1YjMtOTdjZC00ZmM4LWFmYWUtZjJlYTQ4ZjVlNjhkO3N1YnNjcmlwdGlvbklkPTAyODY5ZDJhLTkzYmMtNDkzOC04OTAxLWQ0MjA1MWVmNzA2Mzt0ZW5hbnRJZD1hNGFkZDFkZS1hNTZmLTQ2NTctYjYzMi04Zjk2YWEzZGVlNGM=]
data.azurerm_resource_group.example: Read complete after 0s [id=/subscriptions/02869d2a-93bc-4938-8901-d42051ef7063/resourceGroups/bh-20230615-dev]
azurerm_virtual_network.example: Refreshing state... [id=/subscriptions/02869d2a-93bc-4938-8901-d42051ef7063/resourceGroups/bh-20230615-dev/providers/Microsoft.Network/virtualNetworks/example-network]
azurerm_subnet.example: Refreshing state... [id=/subscriptions/02869d2a-93bc-4938-8901-d42051ef7063/resourceGroups/bh-20230615-dev/providers/Microsoft.Network/virtualNetworks/example-network/subnets/internal]
azurerm_network_interface.example: Refreshing state... [id=/subscriptions/02869d2a-93bc-4938-8901-d42051ef7063/resourceGroups/bh-20230615-dev/providers/Microsoft.Network/networkInterfaces/example-nic]
azurerm_linux_virtual_machine.example: Refreshing state... [id=/subscriptions/02869d2a-93bc-4938-8901-d42051ef7063/resourceGroups/bh-20230615-dev/providers/Microsoft.Compute/virtualMachines/example-machine]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_linux_virtual_machine.example must be replaced
-/+ resource "azurerm_linux_virtual_machine" "example" {
      ~ computer_name                   = "example-machine" -> (known after apply)
      - encryption_at_host_enabled      = false -> null
      ~ id                              = "/subscriptions/02869d2a-93bc-4938-8901-d42051ef7063/resourceGroups/bh-20230615-dev/providers/Microsoft.Compute/virtualMachines/example-machine" -> (known after apply)
      ~ name                            = "example-machine" -> "example-machine-pr" # forces replacement
      ~ private_ip_address              = "10.0.2.4" -> (known after apply)
      ~ private_ip_addresses            = [
          - "10.0.2.4",
        ] -> (known after apply)
      + public_ip_address               = (known after apply)
      ~ public_ip_addresses             = [] -> (known after apply)
      - secure_boot_enabled             = false -> null
      ~ size                            = "Standard_F2" -> "Standard_F1"
      - tags                            = {} -> null
      ~ virtual_machine_id              = "f6ac31aa-e649-4410-8dc0-49850425986d" -> (known after apply)
      - vtpm_enabled                    = false -> null
        # (13 unchanged attributes hidden)

      ~ os_disk {
          ~ disk_size_gb              = 30 -> (known after apply)
          ~ name                      = "example-machine_OsDisk_1_3b5fe900d6c94785a182b4af3532dc19" -> (known after apply)
            # (3 unchanged attributes hidden)
        }

        # (2 unchanged blocks hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pushed by: @BillHally, Action: `pull_request`*